from typing import Literal

album = {}
all_album = {}

album["그나음그"] = Literal["831", "藍二乗", "八月、某、月明かり", "詩書きとコーヒー", 
"713", "踊ろうぜ", "六月は雨上がりの街を書く", "五月は花緑青の窓辺から", 
"夜紛い", "56", "パレード", "エルマ", "410", "だから僕は音楽を辞めた"
]
all_album["그나음그"] = ["831", "藍二乗", "八月、某、月明かり", "詩書きとコーヒー", 
"713", "踊ろうぜ", "六月は雨上がりの街を書く", "五月は花緑青の窓辺から", 
"夜紛い", "56", "パレード", "エルマ", "410", "だから僕は音楽を辞めた"
]

album["도작"] = Literal["音楽泥棒の自白", "昼鳶", "春ひさぎ", "爆弾魔", "青年期、空き巣", 
"レプリカント", "花人局", "朱夏期、音楽泥棒", "盗作", "思想犯", "逃亡", 
"幼年期、思い出の中", "夜行", "花に亡霊"]
all_album["도작"] = ["音楽泥棒の自白", "昼鳶", "春ひさぎ", "爆弾魔", "青年期、空き巣", 
"レプリカント", "花人局", "朱夏期、音楽泥棒", "盗作", "思想犯", "逃亡", 
"幼年期、思い出の中", "夜行", "花に亡霊"]

album["마케이누"] = Literal["前世", "負け犬にアンコールはいらない", "爆弾魔", 
"ヒッチコック", "落下", "準透明少年", "ただ君に晴れ", "冬眠", "夏、バス停、君を待つ"]
all_album["마케이누"] = ["前世", "負け犬にアンコールはいらない", "爆弾魔", 
"ヒッチコック", "落下", "準透明少年", "ただ君に晴れ", "冬眠", "夏、バス停、君を待つ"]

album["싱글"] = Literal["又三郎", "老人と海", "月に吠える", "ブレーメン", "左右盲", "チノカテ"]
all_album["싱글"] = ["又三郎", "老人と海", "月に吠える", "ブレーメン", "左右盲", "チノカテ"]

album["엘마"] = Literal["車窓", "憂一乗", "夕凪、某、花惑い", "雨とカプチーノ", "湖の街", 
"神様のダンス", "雨晴るる", "歩く", "心に穴が空いた", "森の教会", "声", "エイミー", 
"海底、月明かり", "ノーチラス"
]
all_album["엘마"] = ["車窓", "憂一乗", "夕凪、某、花惑い", "雨とカプチーノ", "湖の街", 
"神様のダンス", "雨晴るる", "歩く", "心に穴が空いた", "森の教会", "声", "エイミー", 
"海底、月明かり", "ノーチラス"
]

album["여름풀"] = Literal["夏陰、ピアノを弾く", "カトレア", "言って。", "あの夏に咲け", 
"飛行", "靴の花火", "雲と幽霊"
]
all_album["여름풀"] = ["夏陰、ピアノを弾く", "カトレア", "言って。", "あの夏に咲け", 
"飛行", "靴の花火", "雲と幽霊"
]

album["전세"] = Literal["藍二乗", "だから僕は音楽を辞めた", 
"雨とカプチーノ", "パレード", "言って。", "ただ君に晴れ", "ヒッチコック", 
"青年期、空き巣", "春ひさぎ", "思想犯", "花人局", "春泥棒", "海底、月明かり", 
"ノーチラス", "エルマ", "冬眠"
]
all_album["전세"] = ["藍二乗", "だから僕は音楽を辞めた", 
"雨とカプチーノ", "パレード", "言って。", "ただ君に晴れ", "ヒッチコック", 
"青年期、空き巣", "春ひさぎ", "思想犯", "花人局", "春泥棒", "海底、月明かり", 
"ノーチラス", "エルマ", "冬眠"
]

album["창작"] = Literal["強盗と花束", "春泥棒", "創作", "風を食む", "嘘月"
]
all_album["창작"] = ["強盗と花束", "春泥棒", "創作", "風を食む", "嘘月"
]

album["월광"] = Literal["夕凪、某、花惑い", "八月、某、月明かり", "藍二乗", 
"神様のダンス", "夜紛い", "雨とカプチーノ", "六月は雨上がりの街を書く", 
"雨晴るる", "踊ろうぜ", "歩く", "パレード", "海底、月明かり", "憂一乗", 
"ノーチラス", "だから僕は音楽を辞めた"
]
all_album["월광"] = ["夕凪、某、花惑い", "八月、某、月明かり", "藍二乗", 
"神様のダンス", "夜紛い", "雨とカプチーノ", "六月は雨上がりの街を書く", 
"雨晴るる", "踊ろうぜ", "歩く", "パレード", "海底、月明かり", "憂一乗", 
"ノーチラス", "だから僕は音楽を辞めた"
]

names = {
    "831": "[Inst.] 8/31",
    "藍二乗": "쪽빛 제곱",
    "八月、某、月明かり": "8월, 누군가, 달빛",
    "詩書きとコーヒー": "시 쓰기와 커피",
    "713": "[Inst.] 7/13",
    "踊ろうぜ": "춤추자",
    "六月は雨上がりの街を書く": "6월에는 비가 그친 거리를 쓰네",
    "五月は花緑青の窓辺から": "5월에는 화록청의 창가에서",
    "夜紛い": "밤의 모조품",
    "56": "[Inst.] 5/6",
    "パレード": "퍼레이드",
    "エルマ": "엘마",
    "410": "[Inst.] 4/10",
    "だから僕は音楽を辞めた": "그래서 나는 음악을 그만두었다",
    "音楽泥棒の自白": "[Inst.] 음악도둑의 자백",
    "昼鳶": "낮도둑",
    "春ひさぎ": "봄팔이",
    "爆弾魔": "폭탄마",
    "青年期、空き巣": "[Inst.] 청년기, 빈집털이",
    "レプリカント": "레플리칸트",
    "花人局": "미인계",
    "朱夏期、音楽泥棒": "[Inst.] 장년기, 음악도둑",
    "盗作": "도작",
    "思想犯": "사상범",
    "逃亡": "도망",
    "幼年期、思い出の中": "[Inst.] 유년기, 추억 속",
    "夜行": "야행",
    "花に亡霊": "꽃에 망령",
    "前世": "[Inst.] 전세",
    "負け犬にアンコールはいらない": "패배자에게 앵콜은 필요없어",
    "ヒッチコック": "히치콕",
    "落下": "[Inst.] 낙하",
    "準透明少年": "준투명소년",
    "ただ君に晴れ": "그저 네게 맑아라",
    "冬眠": "동면",
    "夏、バス停、君を待つ": "[Inst.] 여름, 버스 정류장, 너를 기다려",
    "又三郎": "마타사부로",
    "老人と海": "노인과 바다",
    "月に吠える": "달에 짖다",
    "ブレーメン": "브레멘",
    "左右盲": "좌우맹",
    "チノカテ": "치노카테",
    "車窓": "[Inst.] 차창",
    "憂一乗": "우울 한 겹",
    "夕凪、某、花惑い": "무풍, 누군가, 꽃에 취하다",
    "雨とカプチーノ": "비와 카푸치노",
    "湖の街": "[Inst.] 호수의 거리",
    "神様のダンス": "신의 댄스",
    "雨晴るる": "비가 개다",
    "歩く": "걷다",
    "心に穴が空いた": "마음에 구멍이 뚫렸어",
    "森の教会": "숲의 교회",
    "声": "목소리",
    "エイミー": "에이미",
    "海底、月明かり": "[Inst.] 해저, 달빛",
    "ノーチラス": "노틸러스",
    "夏陰、ピアノを弾く": "[Inst.] 여름 그늘, 피아노를 치다",
    "カトレア": "카틀레아",
    "言って。": "말해줘.",
    "あの夏に咲け": "그 여름에 피어나",
    "飛行": "[Inst.] 비행",
    "靴の花火": "구두의 불꽃",
    "雲と幽霊": "구름과 유령",
    "春泥棒": "봄도둑",
    "強盗と花束": "강도와 꽃다발",
    "創作": "[Inst.] 창작",
    "風を食む": "바람을 먹다",
    "嘘月": "거짓말쟁이"
}